### OpenTofu Plan

<details>
<summary>Plan output</summary>

```
data.cloudflare_zone.zone: Reading...
cloudflare_pages_project.preview: Refreshing state... [id=slop-preview]
cloudflare_pages_project.project["homepage"]: Refreshing state... [id=slop-homepage]
cloudflare_pages_project.project["json"]: Refreshing state... [id=slop-json]
cloudflare_pages_project.project["roof-calculator"]: Refreshing state... [id=slop-roof-calculator]
cloudflare_pages_project.project["uno-no-mercy"]: Refreshing state... [id=slop-uno-no-mercy]
cloudflare_pages_project.project["cron"]: Refreshing state... [id=slop-cron]
cloudflare_pages_project.project["flip-7"]: Refreshing state... [id=slop-flip-7]
cloudflare_pages_project.project["subnet"]: Refreshing state... [id=slop-subnet]
cloudflare_pages_project.project["dnd-encounter-generator"]: Refreshing state... [id=slop-dnd-encounter-generator]
data.cloudflare_zone.zone: Read complete after 0s [id=b0bbb73ab7658015ba0417687e96c6ad]
cloudflare_pages_domain.domain["cron"]: Refreshing state... [id=93dca8c4-810a-4ca4-8fd7-7e4824a14802]
cloudflare_pages_domain.domain["dnd-encounter-generator"]: Refreshing state... [id=3a2a6583-9f80-4c6e-b1ac-83bf56c52f81]
cloudflare_pages_domain.domain["roof-calculator"]: Refreshing state... [id=afa26454-f2e7-44c5-8564-544affb89a87]
cloudflare_pages_domain.domain["homepage"]: Refreshing state... [id=607321eb-07f5-469e-a6e1-ff658dfe5230]
cloudflare_pages_domain.domain["flip-7"]: Refreshing state... [id=4d09e73a-6e56-4b83-9a55-1bc3eb5862cb]
cloudflare_pages_domain.domain["json"]: Refreshing state... [id=7d541383-04c5-4309-85d9-4b0c8c56c4d6]
cloudflare_pages_domain.domain["uno-no-mercy"]: Refreshing state... [id=78e736d2-6d44-40f5-9811-b269c9af92e8]
cloudflare_pages_domain.domain["subnet"]: Refreshing state... [id=dfe064cc-2b2e-4275-ad3c-557e7ef15720]
cloudflare_record.cname["json"]: Refreshing state... [id=8af9fe42497d0d10abe71d2c3d89c8f7]
cloudflare_record.cname["flip-7"]: Refreshing state... [id=c20fb50b078be90c61f709baa0043640]
cloudflare_record.cname["homepage"]: Refreshing state... [id=f874cfae4512fd0060402034cb8c46a9]
cloudflare_record.cname["cron"]: Refreshing state... [id=f3a8ec5d1a91d8e086e7469cfbbec103]
cloudflare_record.cname["roof-calculator"]: Refreshing state... [id=9394157b59c935b2a57fda73b3b67ac0]
cloudflare_record.cname["subnet"]: Refreshing state... [id=78f5fcf79086b391ba3e9865d3508101]
cloudflare_record.cname["dnd-encounter-generator"]: Refreshing state... [id=9463936cfb4995d16cbf8bdbe1843c78]
cloudflare_record.cname["uno-no-mercy"]: Refreshing state... [id=74381aab9ca24d8b351e34768eb27b90]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_pages_domain.domain["exploding-kittens"] will be created
  + resource "cloudflare_pages_domain" "domain" {
      + account_id   = "2753badc3d49006d87db13ca87c436d1"
      + domain       = "exploding-kittens.slop.zackpollard.pro"
      + id           = (known after apply)
      + project_name = "slop-exploding-kittens"
      + status       = (known after apply)
    }

  # cloudflare_pages_project.project["exploding-kittens"] will be created
  + resource "cloudflare_pages_project" "project" {
      + account_id        = "2753badc3d49006d87db13ca87c436d1"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "slop-exploding-kittens"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

  # cloudflare_record.cname["exploding-kittens"] will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "exploding-kittens.slop"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "b0bbb73ab7658015ba0417687e96c6ad"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ custom_domains = {
      + exploding-kittens       = {
          + domain = "exploding-kittens.slop.zackpollard.pro"
          + status = (known after apply)
        }
      ~ uno-no-mercy            = {
          ~ status = "initializing" -> "active"
            # (1 unchanged attribute hidden)
        }
        # (7 unchanged attributes hidden)
    }
  ~ pages_projects = {
      + exploding-kittens       = {
          + name      = "slop-exploding-kittens"
          + subdomain = (known after apply)
        }
        # (8 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```

</details>